[
    {
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "Html",
      "author": {
        "name": "Jimmy Dane",
        "img": "https://t3.ftcdn.net/jpg/03/27/40/52/360_F_327405294_4N5JPP9xbcgxZ64RY8uTOcbYAKKDHhPB.jpg"
      },
      "image_url": "https://www.w3.org/html/logo/downloads/HTML5_Logo_512.png",
      "details": "HyperText Markup Language (HTML) is the set of markup symbols or codes inserted into a file intended for display on the Internet. The markup tells web browsers how to display a web page's words and images.Each individual piece markup code (which would fall between  and  characters) is referred to as an element, though many people also refer to it as a tag. Some elements come in pairs that indicate when some display effect is to begin and when it is to end.",
      "price":56
    },
    {
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 500,
      "title": "Css",
      "author": {
        "name": "ashely",
        "img": "https://t3.ftcdn.net/jpg/02/67/73/56/360_F_267735643_RijHFgP1UGQRJPe6nOEIWB6P17qoEndV.jpg"
      },
      "image_url": "https://cdn4.iconfinder.com/data/icons/social-media-logos-6/512/121-css3-512.png",
      "details": "Cascading Style Sheets, fondly referred to as CSS, is a simple design language intended to simplify the process of making web pages presentable.CSS handles the look and feel part of a web page. Using CSS, you can control the color of the text, the style of fonts, the spacing between paragraphs, how columns are sized and laid out, what background images or colors are used, layout designs,variations in display for different devices and screen sizes as well as a variety of other effects.CSS is easy to learn and understand but it provides powerful control over the presentation of an HTML document. Most commonly, CSS is combined with the markup languages HTML or XHTML.",
      "price":65
    },

    {
      
      "category_id": "03",
      "rating": { "number": 4.8, "badge": "Excellent" },
      "total_view": 400,
      "title": "Javascript",
      "author": {
        "name": "Jennifer Wood",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQj4WcieZ3vZTjkCoGkoRTlkDgJEi1BUnid3A&usqp=CAU"
      },
      "image_url": "https://cdn.pixabay.com/photo/2015/04/23/17/41/javascript-736400_960_720.png",
      "details": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities.JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. JavaScript made its first appearance in Netscape 2.0 in 1995 with the name LiveScript. The general-purpose core of the language has been embedded in Netscape, Internet Explorer, and other web browsers.",
      "price":76
    },
    {
      "category_id": "04",
      "rating": { "number": 4.3, "badge": "Excellent" },
      "total_view": 500,
      "title": "React",
      "author": {
        "name": "Foisal",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRIfLgDwNUjIVr4nkfshfzr4JtNHYBIxHOKGA&usqp=CAU"
      },
      "image_url": "https://cdn4.iconfinder.com/data/icons/logos-3/600/React.js_logo-512.png",
      "details": "React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes.Declarative views make your code more predictable and easier to debug.Build encapsulated components that manage their own state, then compose them to make complex UIs.Since component logic is written in JavaScript instead of templates, you can easily pass rich data through your app and keep state out of the DOM.",
      "price":86
    },

    {
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 980,
      "title": "React Native",
      "author": {
        "name": "Gana",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0z8RTrdtEhCZRBliJWABOqkj3gM6gObpBcQ&usqp=CAU"
      },
      "image_url": "https://www.patterns.dev/img/reactjs/react-logo@3x.svg",
      "details": "React Native combines the best parts of native development with React, a best-in-class JavaScript library for building user interfaces.Use a little—or a lot. You can use React Native today in your existing Android and iOS projects or you can create a whole new app from scratch.React primitives render to native platform UI, meaning your app uses the same native platform APIs other apps do.Many platforms, one React. Create platform-specific versions of components so a single codebase can share code across platforms. With React Native, one team can maintain two platforms and share a common technology—React.",
      "price":68
    },
    {
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 980,
      "title": "Python",
      "author": {
        "name": "Mosh Hemadini",
        "img": "https://pbs.twimg.com/profile_images/981311875643195393/dS0t6BQ8_400x400.jpg"
      },
      "image_url": "https://cdn4.iconfinder.com/data/icons/scripting-and-programming-languages/512/Python_logo-512.png",
      "details": "Python is an interpreted, object-oriented, high-level programming language with dynamic semantics. Its high-level built in data structures, combined with dynamic typing and dynamic binding, make it very attractive for Rapid Application Development, as well as for use as a scripting or glue language to connect existing components together. Python's simple, easy to learn syntax emphasizes readability and therefore reduces the cost of program maintenance. Python supports modules and packages, which encourages program modularity and code reuse. The Python interpreter and the extensive standard library are available in source or binary form without charge for all major platforms, and can be freely distributed.",
      "price":96
    }
    
  ]